Dlubal.RFEM5.Tendon
Tendon parameters

Dlubal.RFEM5.Tendon.No
Number

Dlubal.RFEM5.Tendon.ID
Identifier

Dlubal.RFEM5.Tendon.Comment
Comment

Dlubal.RFEM5.Tendon.Tag
Tag

Dlubal.RFEM5.Tendon.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Tendon.Name
Name of tendon

Dlubal.RFEM5.Tendon.Type
Type of tendon

Dlubal.RFEM5.Tendon.LineList
List of reference lines

Dlubal.RFEM5.Tendon.LoadCaseNo
Load cases number of prestress type

Dlubal.RFEM5.Tendon.LoadList
List of equivalent loads defined for this tendon.

Dlubal.RFEM5.Tendon.Diameter
Duct diameter

Dlubal.RFEM5.Tendon.Area
Total area of the material

Dlubal.RFEM5.Tendon.StrandsCount
Number of strands in the tendon

Dlubal.RFEM5.Tendon.WiresCount
Number of wires in the strand (for strand type only)

Dlubal.RFEM5.Tendon.Prestressing
Type of prestressing

Dlubal.RFEM5.Tendon.PrestressingFrom
Indicates the end which is tendon prestressed from

Dlubal.RFEM5.Tendon.PrestressingProcedure
Type of prestressing procedure

Dlubal.RFEM5.Tendon.PrestressingForce
Prestressing force

Dlubal.RFEM5.Tendon.SolverGeo
Additional information for .GEO file

Dlubal.RFEM5.Tendon.SolverSM
Adding to stiffness matrix